# Используем образ Golang в качестве базового
FROM golang:1.17-alpine

# Создаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы из подпапки "code" в контейнер
COPY ./code /app

# Устанавливаем необходимые пакеты (если нужно)
RUN apk add --no-cache ca-certificates

# Собираем и устанавливаем зависимости для Go-приложения
RUN go build -o myapp

# Объявляем, что контейнер будет прослушивать порт 8080 TCP (по вашему выбору)
EXPOSE 8080/tcp

# Запускаем приложение при старте контейнера
CMD ["./myapp"]
